blog/pearson-hashing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Programming Praxis: Pearson Hashing</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' href='/css/site.css' type='text/css'/>
<link href="/css/code.css" rel="stylesheet">
</head>
<body>
<div id="preamble" class="status">
<h1 class="title">Programming Praxis: Pearson Hashing</h1>
          <p class="date">29 May 2018</p>
</div>
<div id="content">
<p>
Here is an implementation in Racket of the Pearson hash exercise from <a href="https://programmingpraxis.com/2018/05/25/pearson-hashing/">programming praxis</a>.
It's based on a <a href="https://www.epaperpress.com/vbhash/download/p677-pearson.pdf">paper</a> by Peter K. Pearson from 1990 [<a href="#Pearson1990FastHashingofVariablelengthTextStrings">1</a>].
</p>

<p>
To compute the Pearson hash of a message, each byte of the message is subsequently added to the accumulated hash modulo 256 and looked up in a substitution table.
The initial hash value is set to zero.
The substitution table is a random permutation of 8-bit numbers.
It is also possible to use <code>XOR</code> instead of addition modulo 256.
Here is a procedure for generating random substitution tables using Racket's <code>shuffle</code>:
</p>
<div class="org-src-container">
<pre class="src src-racket"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">generate-substitution-table</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">define</span> <span class="org-variable-name">original-table</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">range</span> <span class="org-racket-selfeval">256</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-builtin">list-&gt;vector</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">shuffle</span> original-table<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">print-table</span> tbl<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">define</span> <span class="org-variable-name">row</span> <span class="org-racket-selfeval">0</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">for</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>val tbl<span class="org-rainbow-delimiters-depth-4">]</span>
        <span class="org-rainbow-delimiters-depth-4">[</span>i <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-builtin">vector-length</span> tbl<span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">printf</span> <span class="org-string">"~a "</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">~a</span> val <span class="org-racket-keyword-argument">#:width</span> <span class="org-racket-selfeval">3</span> <span class="org-racket-keyword-argument">#:align</span> <span class="org-racket-selfeval">'right</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-keyword">when</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">zero?</span> <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-builtin">modulo</span> <span class="org-rainbow-delimiters-depth-6">(</span><span class="org-builtin">+</span> i <span class="org-racket-selfeval">1</span><span class="org-rainbow-delimiters-depth-6">)</span> <span class="org-racket-selfeval">16</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">set!</span> row <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-builtin">+</span> row <span class="org-racket-selfeval">1</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span>
      <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">printf</span> <span class="org-string">"\n"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-builtin">random-seed</span> <span class="org-racket-selfeval">0</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-variable-name">substitution-table</span> <span class="org-rainbow-delimiters-depth-2">(</span>generate-substitution-table<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span>print-table substitution-table<span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<pre class="example">
#&lt;void&gt;
</pre>


<p>
This algorithm will compute a 8-bit hash for any message.
To generate 16-bit hashes, the same message is hashed again, but this time, 1 is added to the first byte modulo 256.
The second hash byte is appended to the first one.
This can be extended to compute hashes longer than one byte.
Though, after 256 bytes, the hash bytes will start repeating.
</p>

<div class="org-src-container">
<pre class="src src-racket"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">pearson-hash-n-bytes</span> message tbl fn n<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">define</span> <span class="org-variable-name">result</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">make-vector</span> n<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">for</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>i n<span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">vector-set!</span> result i
                 <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-keyword">for/fold</span> <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">[</span>sum i<span class="org-rainbow-delimiters-depth-6">]</span><span class="org-rainbow-delimiters-depth-5">)</span> <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-rainbow-delimiters-depth-6">[</span>byte message<span class="org-rainbow-delimiters-depth-6">]</span><span class="org-rainbow-delimiters-depth-5">)</span>
                   <span class="org-rainbow-delimiters-depth-5">(</span><span class="org-builtin">vector-ref</span> tbl <span class="org-rainbow-delimiters-depth-6">(</span>fn sum byte<span class="org-rainbow-delimiters-depth-6">)</span><span class="org-rainbow-delimiters-depth-5">)</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>
  result<span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">+mod256</span> a b<span class="org-rainbow-delimiters-depth-2">)</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-builtin">modulo</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">+</span> a b<span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-racket-selfeval">256</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Let's compute the hash for some messages.
</p>
<div class="org-src-container">
<pre class="src src-racket"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-variable-name">message</span> #<span class="org-string">"Programming Praxis"</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span>pearson-hash-n-bytes message substitution-table <span class="org-builtin">bitwise-xor</span> <span class="org-racket-selfeval">1</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<pre class="example">
#(11)
</pre>



<p>
And here is computation of Pearson hashes side by side using two procedures: addition modulo 256 and <code>XOR</code>.
</p>
<div class="org-src-container">
<pre class="src src-racket"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">for</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-rainbow-delimiters-depth-3">[</span>n-bytes <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">range</span> <span class="org-racket-selfeval">1</span> <span class="org-racket-selfeval">11</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">]</span><span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-builtin">printf</span> <span class="org-string">"~a: ~a ~a~n"</span> 
          <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">~a</span> <span class="org-racket-keyword-argument">#:min-width</span> <span class="org-racket-selfeval">2</span> <span class="org-racket-keyword-argument">#:align</span> <span class="org-racket-selfeval">'right</span> n-bytes<span class="org-rainbow-delimiters-depth-3">)</span>
          <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">~a</span> <span class="org-racket-keyword-argument">#:min-width</span> <span class="org-racket-selfeval">40</span>
              <span class="org-rainbow-delimiters-depth-4">(</span>pearson-hash-n-bytes message substitution-table +mod256 n-bytes<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>
          <span class="org-rainbow-delimiters-depth-3">(</span>pearson-hash-n-bytes message substitution-table <span class="org-builtin">bitwise-xor</span> n-bytes<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<pre class="example">
#&lt;void&gt;
</pre>



<p>
A sequence of numbers is ideal for representing a hash value, but is nicer to read in string form.
Here is a procedure for converting sequences of numbers into strings of hex numbers.
</p>
<div class="org-src-container">
<pre class="src src-racket"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">define</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-function-name">hash-vector-&gt;string</span> hash-vec<span class="org-rainbow-delimiters-depth-2">)</span>
  <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-keyword">for/fold</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>result <span class="org-string">""</span><span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">)</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-rainbow-delimiters-depth-4">[</span>byte hash-vec<span class="org-rainbow-delimiters-depth-4">]</span><span class="org-rainbow-delimiters-depth-3">)</span>
    <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">~a</span> result <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-builtin">~r</span> byte <span class="org-racket-keyword-argument">#:base</span> <span class="org-racket-selfeval">16</span> <span class="org-racket-keyword-argument">#:min-width</span> <span class="org-racket-selfeval">2</span> <span class="org-racket-keyword-argument">#:pad-string</span> <span class="org-string">"0"</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>

<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-builtin">printf</span> <span class="org-string">"~a\n"</span> <span class="org-rainbow-delimiters-depth-2">(</span>hash-vector-&gt;string #<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-racket-selfeval">1</span> <span class="org-racket-selfeval">2</span> <span class="org-racket-selfeval">3</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-builtin">printf</span> <span class="org-string">"~a\n"</span> <span class="org-rainbow-delimiters-depth-2">(</span>hash-vector-&gt;string <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-builtin">range</span> <span class="org-racket-selfeval">0</span> <span class="org-racket-selfeval">32</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<pre class="example">
#&lt;void&gt;
</pre>



<div id="bibliography">
<h2>References</h2>

<table>

<tr valign="top">
<td align="right" class="bibtexnumber">
[<a name="Pearson1990FastHashingofVariablelengthTextStrings">1</a>]
</td>
<td class="bibtexitem">
Peter&nbsp;K. Pearson.
 Fast hashing of variable-length text strings.
 <em>Commun. ACM</em>, 33(6):677&ndash;680, June 1990.
[&nbsp;<a href="http://dx.doi.org/10.1145/78973.78978">DOI</a>&nbsp;| 
<a href="http://doi.acm.org/10.1145/78973.78978">http</a>&nbsp;]

</td>
</tr>
</table>
</div>


<br><div class='footer'><a href="https://peter-samarin.de">Peter Samarin</a></div>

<br>
<script src="https://utteranc.es/client.js"
repo="oetr/oetr.github.io"
issue-term="pathname"
label="comments"
theme="github-light"
crossorigin="anonymous"
async>
</script>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
